import matplotlib.pyplot as plt

# Данные
x = [1, 2, 3, 4, 5]
y1 = [1.659989356994629e-05,1.5399884432554245e-05,1.5200115740299225e-05,1.4999881386756897e-05,1.529976725578308e-05]
y2 = [1.5700235962867737e-05,1.4899764209985733e-05,1.3699755072593689e-05,1.3299752026796341e-05,1.529976725578308e-05]
y3 = [1.4699995517730713e-05,1.679966226220131e-05,1.6700010746717453e-05,1.619989052414894e-05,1.600012183189392e-05]
y4 = [1.3399869203567505e-05,1.5399884432554245e-05,1.400010660290718e-05,1.400010660290718e-05,1.4199875295162201e-05]

plt.plot(x, y1, label='Измерение для 100 бабл')
plt.plot(x, y2, label='Измерение для 100 выбор')
plt.plot(x, y3, label='Измерение для 1000 бабл')
plt.plot(x, y4, label='Измерение для 1000 выбор')

plt.legend()
plt.xlabel('Ось X - Количество попыток')
plt.ylabel('Ось Y - время затраченое на попытку')
plt.title('Сравнение двух измерений')
plt.show()